[
  {
    "content": "imagine a wardrobe that seamlessly blends clean lines, carbon-neutral production, and tech-forward fashion. that's the ethos behind artificial wearables - minimalist apparel that puts sustainability and innovation at the forefront. each piece is designed with an AI-inspired ae...",
    "timestamp": "2025-03-04T15:54:47.173647",
    "success": true
  },
  {
    "content": "yo, i just saw this new ai-powered fashion brand that uses recycled materials. like, how crazy is that? they're making sustainable streetwear that's actually dope. ngl i'm kind of obsessed with how they're blending tech and eco-friendly fab. really cool stuff\n\nh/t @artificialwear",
    "timestamp": "2025-03-04T15:58:19.662457",
    "success": true
  },
  {
    "content": "here's a thoughtful tweet from the Artificial Wearables account:\n\nour ai-powered design process allows us to create sustainable fashion from recycled materials - without compromising on style. the future of apparel is minimalist, carbon-neutral, and tech-forward. less is more ...",
    "timestamp": "2025-03-04T16:00:05.353873",
    "success": true
  },
  {
    "content": "we're exploring how virtual garment simulation can reduce textile waste in the design process",
    "timestamp": "2025-03-04T16:04:09.359889",
    "success": true
  },
  {
    "content": "the small details make all the difference",
    "timestamp": "2025-03-04T16:05:53.459471",
    "success": true
  },
  {
    "content": "clean lines, careful composition",
    "timestamp": "2025-03-04T16:06:34.638877",
    "success": true
  },
  {
    "content": "our tees feel so soft straight out of the wash",
    "timestamp": "2025-03-04T16:07:49.504570",
    "success": true
  },
  {
    "content": "the latest print design started as an accident but we love how the overlapping stripes turned out",
    "timestamp": "2025-03-04T16:09:27.572066",
    "success": true
  },
  {
    "content": "our classic basic tee is a closet staple. simple, comfy, and goes with everything",
    "timestamp": "2025-03-04T16:13:03.590071",
    "success": true
  },
  {
    "content": "soft, premium fabrics - that's our focus",
    "timestamp": "2025-03-04T16:16:27.149899",
    "success": false
  }
]